---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold.TopBendLength
source: html/cf9cdecf-fba1-8123-5df7-da8018023e7c.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold.TopBendLength Property

Top Bend segment length.

## Syntax (C#)
```csharp
public double TopBendLength { get; set; }
```